Update DOCUMENTATION.md
